time: add datetime, dateonly, timeonli format constant
propos declar follow format constant `time` package:
```go
const (
    DateTime = "2006-01-02 15:04:05"
    DateOnly = "2006-01-02"
)
```
analyz go code modul proxi (a 2022-04-01), here' tabl common time format sort popular order:
| rank | frequenc | format |
| -----| ---------- | ------ |
| 1 | 75616 | `time.rfc3339` |
| 2 | 23954 | `time.rfc3339nano` |
| 3 | 13312 | `"2006-01-02 15:04:05"` |
| 4 | 12332 | `"2006-01-02"` |
| 5 | 11940 | `time.rfc1123` |
| 6 | 2998 | `time.rfc1123z` |
| 7 | 2871 | `time.unixdate` |
| 8 | 2843 | `time.ansic` |
| 9 | 2820 | `"20060102"` |
| 10 | 2600 | `time.rfc822` |
| 11 | 2522 | `time.kitchen` |
| 12 | 2499 | `"20060102150405"` |
| 13 | 2225 | `"15:04:05"` |
| 14 | 1503 | `time.rfc850` |
| 15 | 1410 | `time.stamp` |
| 16 | 1374 | `"2006-01-02t15:04:05z"` |
| 17 | 1302 | `"2006-01-02t15:04:05"` |
| 18 | 1152 | `"2006"` |
| 19 | 1149 | `"2006/01/02 15:04:05"` |
| 20 | 1133 | `time.stampmilli` |
| 21 | 1122 | `time.rfc822z` |
| 22 | 1059 | `time.rubydate` |
| 23 | 962 | `"15:04"` |
| 24 | 934 | `"2006-01-02 15:04:05.000"` |
| 25 | 879 | `"2006010215"` |
| 26 | 685 | `"15:04:05.000"` |
| 27 | 668 | `"2006-01-02 15:04"` |
| 28 | 646 | `"2006/01/02 - 15:04:05"` |
| 29 | 637 | `"2006/01/02"` |
| 30 | 552 | `time.stampnano` |
| 31 | 533 | `time.stampmicro` |
seen, `"2006-01-02 15:04:05"` `"2006-01-02"` 3rd 4th popular format constants. popular `time` format constant get name declaration.
given popularity, propos declaring:
```go
const (
    DateTime = "2006-01-02 15:04:05"
    DateOnly = "2006-01-02"
)
```
constant name suggest welcome.
perhap `timeonly` `"15:04:05"` 13th place would also make sense.
`isodate`: "2006-01-02" iso 8601 extend date format (basic 20060102).
`isotime`: "15:04:05" iso 8601 extend time format (basic 150405).
rfc3339 provid extend iso date time format - use `t` separ (mandatory) includ timezone.
perhap someth like `isodateandtime` could used? technically, `isodatetime` rfc3339 without timezon sinc iso requir use `t` (henc "dateandtime").
sound like mayb
```
const (
    ISO8601 = "2006-01-02 15:04:05"
    ISO8601Nano = "2006-01-02 15:04:05.999999999"
    ISO8601Date = "2006-01-02"
)
```
would align rfc3339 rfc3339nano add date-onli form.
thoughts?
/cc @robpik
also, thank great data @dsnet
iso name fine, see advantag also nicer name like timeonli dateonli aliases. remain fan time.kitchen, underused.
use read specs, overwhelm iso 8601 ðŸ¤¯. wikipedia, says:
> separ date time part charact **such space allow iso 8601**, allow profil rfc 3339.
true, seem `iso8601 = "2006-01-02 15:04:05"` valid iso 8601. what' realli odd sourc statement come rfc 3339 refer iso 8601 say that.
(side comment: thank go languag simpl concis languag specification).
ok, sound like can't call iso8601, mayb that' specif enough either. call instead?
```
    DateTime = "2006-01-02 15:04:05"
    DateTimeNano = "2006-01-02 15:04:05.999999999"
    DateOnly = "2006-01-02"
    TimeOnly = "15:04:05"
    TimeOnlyNano = "15:04:05.999999999"
```
also 9999 come rfc3339 definition; stamp 0s instead, mean digit alway there:
```
	Stamp      = "Jan _2 15:04:05"
	StampMilli = "Jan _2 15:04:05.000"
	StampMicro = "Jan _2 15:04:05.000000"
	StampNano  = "Jan _2 15:04:05.000000000"
```
know want either.
mayb bite much do:
datetim = "2006-01-02 15:04:05"
dateonli = "2006-01-02"
stop there?
`datetime` `dateonly` sgtm. also okay throw `timeonly` mix per
`nano` variant seem bit excess data support utility.
propos ad activ column propos project
review weekli propos review meetings.
â€” rsc propos review group
propos format defin `internet date/tim format` mayb name could either `rfc3339datetime, rfc3339date rfc3339time` `internetdatetim internetd internettime`.
> name could either `rfc3339datetime, rfc3339date rfc3339time`
prefer human-friendli name without yet anoth number sequence.
> prefer human-friendli name without yet anoth number sequence.
`internetdatetime`, `internetdate` `internettime` get away without lame `only` suffix?
> > prefer human-friendli name without yet anoth number sequence.
>
> `internetdatetime`, `internetdate` `internettime` get away without lame `only` suffix?
`only` obviou meaning. `internet` prefix noth time formats.
given @dsnet' data, let' consid doing:
datetim = "2006-01-02 15:04:05"
dateonli = "2006-01-02"
timeonli = "15:04:05"
anyon object these?
> analyz go code modul proxi (a 2022-04-01), here' tabl common time format sort popular order:
would possibl tell user name constants?
>> name could either rfc3339datetime, rfc3339date rfc3339time
> prefer human-friendli name without yet anoth number sequence.
look top two popular format think user mean use "reduced" rfc3339 format. someth els rfc3339 format put field descend order make string represent sortable. field separ also `-`.
> `internet` prefix noth time formats.
per format somewhat defin rfc section name "internet date/tim format". also note space separ use formats:
> note: iso 8601 defin date time separ "t".
applic use syntax may choose, sake
readability, specifi full-dat full-tim separ
(say) space character.
usag situ:
```go
time.Parse(time.DateTime, s)
time.Parse(time.DateOnly, s)
time.Parse(time.TimeOnly, s)
```
vs
```go
time.Parse(time.RFC3339DateTime, s)
time.Parse(time.RFC3339Date, s)
time.Parse(time.RFC3339Time, s)
```
vs
```go
time.Parse(time.InternetDateTime, s)
time.Parse(time.InternetDate, s)
time.Parse(time.InternetTime, s)
```
> would possibl tell user name constants?
think taken directli call sites. name like `"2006-01-02"`.
base discuss above, propos seem like **like accept**.
â€” rsc propos review group
chang consensus, **accepted**. ðŸŽ‰
